const months = ['January', 'February', 'March']

console.log(months.join());
console.log(months.join(''));
console.log(months.join('-'));

//ეს ფუნქცია გვაძლევს იმის საშუალებას რომ ერეის ელემენტები გავაერთიანოთ სურვილისამებრ

const names = ['Natia', 'Mushni', 'Mariam', 'Papuna']
names.sort();

console.log(names);

const numbers = [12, 37, 7, 99, 35]
numbers.sort();

console.log(numbers);

//ეს ფუნქცია ტექსტის შემთხვევაში სიტყვებს ალაგებს ანბანის მიხედვით, ხოლო რიცხვების შემთხვევაში ალაგებს რიგითობის მიხედვით ოღონდ ჯერ ადარებს პირველ რიცხვს და შემდეგ სხვას.

const num = [11, 22, 33, 44, 55, 66]

console.log(num.fill(77, 1, 5));
console.log(num.fill(88, 2));
console.log(num.fill(99));

//ეს ფუნქცია გვაძლევს იმის საშუალებას, რომ ერეიში ელემენტებს შევუცვალოთ მნიშვნელობა. პირველ შემთხვევაში, როდესაც სამ მნიშვნელობას ვწერთ
//ფრჩხილებში, პირველ ადგილას ვწერთ იმ მნიშვნელობას, რომელიც გვინდა რომ მიენიჭოს კონკრეტულ ელემენტებს, მეორე ადგილას ვწერთ მერამდენე ელემენტიდან 
//გვსურს რომ დაიწყოს ამ მნიშვნელობის მიღება, ხოლო ბოლო ადგილას კი ვწერთ იმ რიგის ნომერს, რომლამდეც გვსურს რომ გაგრძელდეს ელემენტით ჩანაცვლება.